# Movie Budget & Revenue Dataset
- Data collected May 1st 2018

In [3]:
import pandas as pd

## Data Exploration & Cleaning

In [5]:
data = pd.read_csv("cost_revenue.csv")

In [6]:
data.sample()

,Rank,Release_Date,Movie_Title,USD_Production_Budget,USD_Worldwide_Gross,USD_Domestic_Gross
2960,2087,8/24/2007,War,"$25,000,000","$40,686,409","$22,486,409"

In [7]:
data.shape

(5391, 6)

In [8]:
data.dtypes

Rank                      int64
Release_Date             object
Movie_Title              object
USD_Production_Budget    object
USD_Worldwide_Gross      object
USD_Domestic_Gross       object
dtype: object

In [9]:
data[data.isna().any(axis=1)]

Empty DataFrame
Columns: [Rank, Release_Date, Movie_Title, USD_Production_Budget, USD_Worldwide_Gross, USD_Domestic_Gross]
Index: []

In [10]:
data.nunique()

Rank                     5391
Release_Date             2262
Movie_Title              5318
USD_Production_Budget     484
USD_Worldwide_Gross      4969
USD_Domestic_Gross       4809
dtype: int64

In [11]:
data.duplicated(['Movie_Title','Release_Date'], keep=False).value_counts()

False    5389
True        2
Name: count, dtype: int64

- The dataset contains 5391 rows, with 6 columns of data.
- The data types for 'Release_date', 'USD_Production_Budget', 'USD_Worldwide_Gross', 'USD_Domestic_Gross' are currently set to 'object' - these will need to be updated.
- The data type for 'Release_Date' needs to be changed to date format
- There are no rows with any missing values
- There appears to be 2 duplicate entries: Searching for duplicates using Movie_Title + Release_Date (To account for films with the same name, released in differernt years)

## Data Cleaning

Required actions:
- Investigate and remove rows with duplicated movie titles
- Convert columns to correct data types

In [15]:
data.sample()

,Rank,Release_Date,Movie_Title,USD_Production_Budget,USD_Worldwide_Gross,USD_Domestic_Gross
4241,3789,9/21/2012,House at the End of the Street,"$6,900,000","$44,103,982","$31,611,916"

In [16]:
data[data.duplicated(['Movie_Title','Release_Date'], keep=False)]

,Rank,Release_Date,Movie_Title,USD_Production_Budget,USD_Worldwide_Gross,USD_Domestic_Gross
3054,5289,12/31/2007,A Dog's Breakfast,"$120,000",$0,$0
3055,5290,12/31/2007,A Dog's Breakfast,"$120,000",$0,$0

In [17]:
data.drop_duplicates(['Movie_Title','Release_Date'], keep=False, inplace=True)

In [18]:
data[data.duplicated(['Movie_Title','Release_Date'], keep=False)]

Empty DataFrame
Columns: [Rank, Release_Date, Movie_Title, USD_Production_Budget, USD_Worldwide_Gross, USD_Domestic_Gross]
Index: []

In [44]:
data.duplicated(['Movie_Title','Release_Date'], keep=False).value_counts()

False    5389
Name: count, dtype: int64

- There are 5389 rows remaining after removing the 2 duplicates

In [21]:
data.sample()

,Rank,Release_Date,Movie_Title,USD_Production_Budget,USD_Worldwide_Gross,USD_Domestic_Gross
4195,5090,7/17/2012,Girls Gone Dead,"$500,000",$0,$0

In [64]:
data['USD_Production_Budget'] = data['USD_Production_Budget'].astype(str).str.replace('\\$', "", regex=True)
data['USD_Worldwide_Gross'] = data['USD_Worldwide_Gross'].astype(str).str.replace('\\$', "", regex=True)
data['USD_Domestic_Gross'] = data['USD_Domestic_Gross'].astype(str).str.replace('\\$', "", regex=True)

In [66]:
data.sample()

,Rank,Release_Date,Movie_Title,USD_Production_Budget,USD_Worldwide_Gross,USD_Domestic_Gross
3477,1729,10/4/2009,Hannah Montana the Movie,30000000,169173206,79576189

In [74]:
data.USD_Production_Budget = data.USD_Production_Budget.astype('int64')
data.USD_Worldwide_Gross = data.USD_Worldwide_Gross.astype('int64')
data.USD_Domestic_Gross = data.USD_Domestic_Gross.astype('int64')

In [76]:
data.sample()

,Rank,Release_Date,Movie_Title,USD_Production_Budget,USD_Worldwide_Gross,USD_Domestic_Gross
2188,3821,2/27/2004,"Good Bye, Lenin!",6400000,79384539,4063859

In [192]:
data['Release_Date'] = pd.to_datetime(data['Release_Date'], format="%m/%d/%Y")

In [194]:
data.dtypes

Rank                              int64
Release_Date             datetime64[ns]
Movie_Title                      object
USD_Production_Budget             int64
USD_Worldwide_Gross               int64
USD_Domestic_Gross                int64
dtype: object

- The datatypes for columns displaying currency have been fixed, the datatype for the Release_Date column has been changed to datetime

## Data Exploration

Some exploratory questions to answer:
1. What is the average production budget of the films in the data set?
2. What is the average worldwide gross revenue of films?
3. What were the minimums for worldwide and domestic revenue?
4. Are the bottom 25% of films actually profitable or do they lose money?
5. What are the highest production budget and highest worldwide gross revenue of any film?
6. How much revenue did the lowest and highest budget films make?
7. How many films grossed \\$0 domestically?
8. What were the highest budget films that grossed nothing?
9. How many films grossed \\$0 worldwide?
10. How many films grossed \\$0 domestically but grossed internationally?
11. Which films were not released yet at the time of data collection?
12. What percentage of films did not break even at the box office?

In [102]:
data.describe().apply(lambda s: s.apply('{0:.5f}'.format))

             Rank USD_Production_Budget USD_Worldwide_Gross USD_Domestic_Gross
count  5389.00000            5389.00000          5389.00000         5389.00000
mean   2695.03748        31125240.17165      88888398.55279     41250823.03173
std    1555.87837        40526916.68195     168480319.02353     66036819.50498
min       1.00000            1100.00000             0.00000            0.00000
25%    1348.00000         5000000.00000       3894240.00000      1340891.00000
50%    2695.00000        17000000.00000      27469621.00000     17200925.00000
75%    4042.00000        40000000.00000      96469187.00000     52353636.00000
max    5391.00000       425000000.00000    2783918982.00000    936662225.00000

1. The average production budget for a film is about \\$31 million
2. The average worldwide gross revenue for a film is about ~\\$89 million
3. The minimum worldwide and domestic revenue for a film is \\$0
4. Of the bottom 25% of films, the average budget is \\$5 million and the average worldwide gross revenue is ~\\$3.8 million, so they lose money on average.
5. The highest production budget for a film is \\$425 million, the highest worldwide gross revenue is ~\\$2.8 billion.

In [109]:
data[data.USD_Production_Budget == 1100]

,Rank,Release_Date,Movie_Title,USD_Production_Budget,USD_Worldwide_Gross,USD_Domestic_Gross
2427,5391,5/8/2005,My Date With Drew,1100,181041,181041

In [111]:
data[data.USD_Production_Budget == 425000000]

,Rank,Release_Date,Movie_Title,USD_Production_Budget,USD_Worldwide_Gross,USD_Domestic_Gross
3529,1,12/18/2009,Avatar,425000000,2783918982,760507625

6.
- The film with the lowest budget was 'My Date With Drew' with a budget of \\$1100, which made a revenue of \\$181,041
- The film with the highest budget was 'Avatar' with a budget of \\$425000000, which made a revenue of \\$2,783,918,982

In [120]:
data[data.USD_Domestic_Gross == 0].count()

Rank                     510
Release_Date             510
Movie_Title              510
USD_Production_Budget    510
USD_Worldwide_Gross      510
USD_Domestic_Gross       510
dtype: int64

7. There were 510 films that grossed \\$0 domestically

In [137]:
domestic = data.USD_Domestic_Gross == 0
worldwide = data.USD_Worldwide_Gross == 0
data[domestic & worldwide].sort_values('USD_Production_Budget', ascending=False).head()

,Rank,Release_Date,Movie_Title,USD_Production_Budget,USD_Worldwide_Gross,USD_Domestic_Gross
5388,96,12/31/2020,Singularity,175000000,0,0
5387,126,12/18/2018,Aquaman,160000000,0,0
5384,321,9/3/2018,A Wrinkle in Time,103000000,0,0
5385,366,10/8/2018,Amusement Park,100000000,0,0
5058,880,11/12/2015,The Ridiculous 6,60000000,0,0

8. 
- The highest budget for a film that grossed \\$0 was \\$175,000,000
- The second highest was \\$160,000,000 and the third was \\$103,000,000

In [146]:
data[data.USD_Worldwide_Gross == 0].count()

Rank                     355
Release_Date             355
Movie_Title              355
USD_Production_Budget    355
USD_Worldwide_Gross      355
USD_Domestic_Gross       355
dtype: int64

9. There were 355 films that grossed \\$0 worldwide

In [157]:
data.query('USD_Domestic_Gross == 0 and USD_Worldwide_Gross != 0')

,Rank,Release_Date,Movie_Title,USD_Production_Budget,USD_Worldwide_Gross,USD_Domestic_Gross
71,4310,2/16/1956,Carousel,3380000,3220,0
1579,5087,2/11/2001,Everything Put Together,500000,7890,0
1744,3695,12/31/2001,The Hole,7500000,10834406,0
2155,4236,12/31/2003,Nothing,4000000,63180,0
2203,2513,3/31/2004,The Touch,20000000,5918742,0
...,...,...,...,...,...,...
5340,1506,4/14/2017,Queen of the Desert,36000000,1480089,0
5348,2225,5/5/2017,Chāi dàn zhuānjiā,23000000,58807172,0
5360,4832,7/3/2017,Departure,1100000,27561,0
5372,1856,8/25/2017,Ballerina,30000000,48048527,0
5374,4237,8/25/2017,Polina danser sa vie,4000000,36630,0

10. There are 155 films that made \\$0 domestically but made money worldwide

In [186]:
data_collection = pd.Timestamp('2018-05-01')

In [190]:
data.dtypes

Rank                      int64
Release_Date             object
Movie_Title              object
USD_Production_Budget     int64
USD_Worldwide_Gross       int64
USD_Domestic_Gross        int64
dtype: object

In [196]:
data[data.Release_Date >= data_collection]

,Rank,Release_Date,Movie_Title,USD_Production_Budget,USD_Worldwide_Gross,USD_Domestic_Gross
5384,321,2018-09-03,A Wrinkle in Time,103000000,0,0
5385,366,2018-10-08,Amusement Park,100000000,0,0
5386,2950,2018-10-08,Meg,15000000,0,0
5387,126,2018-12-18,Aquaman,160000000,0,0
5388,96,2020-12-31,Singularity,175000000,0,0
5389,1119,2020-12-31,Hannibal the Conqueror,50000000,0,0
5390,2517,2020-12-31,"Story of Bonnie and Clyde, The",20000000,0,0

11. The films that were unreleased at the time of data collection are shown above

In [202]:
unreleased = data[data.Release_Date >= data_collection]
data = data.drop(unreleased.index)

In [204]:
data.shape

(5382, 6)

In [213]:
data.query('USD_Worldwide_Gross < USD_Production_Budget')

,Rank,Release_Date,Movie_Title,USD_Production_Budget,USD_Worldwide_Gross,USD_Domestic_Gross
1,5140,1916-05-09,Intolerance,385907,0,0
6,4630,1927-12-08,Wings,2000000,0,0
8,4240,1930-01-01,Hell's Angels,4000000,0,0
15,4738,1936-05-02,Modern Times,1500000,165049,163245
17,4814,1936-10-20,"Charge of the Light Brigade, The",1200000,0,0
...,...,...,...,...,...,...
5371,4901,2017-07-28,An Inconvenient Sequel,1000000,130874,130874
5373,2161,2017-08-25,Tulip Fever,25000000,0,0
5374,4237,2017-08-25,Polina danser sa vie,4000000,36630,0
5381,94,2017-12-05,King Arthur: Legend of the Sword,175000000,140012608,39175066
5383,2521,2017-12-31,The Thousand Miles,20000000,0,0

12. 
- There are 2005 films in the dataset out of 5382 which show that their production budget as greater than their worldwide gross. 
- This represents a total of 36.2% of films